casoHelice3/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    Face_Down
    {
        type            patch;
        nFaces          653;
        startFace       3731;
    }
    Inner_Body
    {
        type            patch;
        nFaces          126;
        startFace       4384;
    }
    Face_Up
    {
        type            patch;
        nFaces          859;
        startFace       4510;
    }
)

// ************************************************************************* //
